app/Controllers/Projekt.php

    public function index()
{
 if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $clickModel = new ClickModel();

        $user_id = session()->get('user_id');

        $click = $clickModel
            ->where('user_id', $user_id)
            ->first();
---
SELECT *
FROM `clicks`
WHERE `user_id` = '1'
 LIMIT 1

    public function click()
 {
  if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $clickModel = new ClickModel();
        $user_id = session()->get('user_id');

        $click = $clickModel
            ->where('user_id', $user_id)
            ->first();

        if ($click) {
            $clickModel->update(
                $click['id'],
                ['count' => $click['count'] + 1]
            );
---
SELECT *
FROM `clicks`
WHERE `user_id` = '1'
 LIMIT 1
UPDATE `clicks` SET `count` = 2
WHERE `clicks`.`id` IN ('1')

 public function loginProcess()
 {
  $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $userModel
            ->where('username', $username)
            ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'user'
 LIMIT 1